&НаСервере
Функция ЗаписьЗанятости()
	//зан=Объект.Грузчик.получитьобъект();
		об=Объект.Грузчик.ПолучитьОбъект();	//зан.Записать();
		об.Занятость="Грузчик";
		об.Записать();


КонецФункции

&НаСервере
Функция ПроверкаЗанятости()
	//зан=Объект.Грузчик.получитьобъект();
	флаг=ложь;
	если Объект.Грузчик.Занятость="" тогда 
		флаг=Истина;
		возврат флаг;
	иначе
		возврат флаг;
	конецесли;

КонецФункции

&НаСервере
Функция обнуление()
	  	об=Объект.Грузчик.ПолучитьОбъект();	//зан.Записать();
		об.Занятость=NULL;
		об.Записать();
		ПараметрыСеанса.ПарСеанс="лотлдод";

КонецФункции

&НаСервере
Функция ОтправкаСообщения()
	  	мес=новый СообщениеПользователю;
		мес.Текст="Данное физическое лицо уже задействовано: "+Объект.Грузчик.Занятость;
		мес.Сообщить();

КонецФункции


&НаКлиенте
Процедура ГрузчикПриИзменении(Элемент)
	мас=новый массив(3);
	мас[0]=1;
	мас[2]=3;

	если ПроверкаЗанятости() тогда
		Объект.Наименование=Объект.Грузчик;
		ЗаписьЗанятости();   
	иначе
		ОтправкаСообщения();
		Объект.Грузчик=NULL;
				отказ=истина;
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	если Не ПроверкаЗанятости() тогда
		Обнуление();   
	конецесли;

КонецПроцедуры



