&НаКлиенте
Процедура РасчетСуммы(Элемент)
	    ТД=Элементы.Товары.ТекущиеДанные;
	    ТД.Сумма=ТД.Цена*ТД.Количество;
		если Объект.Товары.Итог("Сумма")>10000 тогда
			сообщение=новый СообщениеПользователю;
			сообщение.Текст="Вам предоставляется бесплатная доставка!!!";
			сообщение.Сообщить();

		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость=истина;
		иначе
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость=ложь;
		КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчетСуммы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчетСуммы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	тест=Элементы.Товары;
	если Объект.Товары.Итог("Сумма")>10000 тогда
		сообщение=новый СообщениеПользователю;
		сообщение.Текст="Вам предоставляется бесплатная доставка!!!";
		сообщение.Сообщить();

	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость=истина;
	иначе
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость=ложь;
	КонецЕсли;
КонецПроцедуры
