
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗаявкаНаТранспорт.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаТранспорт.Автомобиль КАК Автомобиль,
	|	ЗаявкаНаТранспорт.Адресс КАК Адресс,
	|	ЗаявкаНаТранспорт.Дата КАК Дата,
	|	ЗаявкаНаТранспорт.ДокументОснование КАК ДокументОснование,
	|	ЗаявкаНаТранспорт.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЗаявкаНаТранспорт.Номер КАК Номер,
	|	ЗаявкаНаТранспорт.НомерАвтомобиля КАК НомерАвтомобиля,
	|	ЗаявкаНаТранспорт.Покупатель КАК Покупатель
	|ИЗ
	|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
	|ГДЕ
	|	ЗаявкаНаТранспорт.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ДокументОСН=Выборка.ДокументОснование;
	//об=ДокументОСН.ПолучитьОбъект();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		ВставлятьРазделительСтраниц = Истина;
		

		

	КонецЦикла;
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТоваровТовары.НомерСтроки КАК НомерСтроки,
		|	ПродажаТоваровТовары.номенклатура КАК номенклатура,
		|	ПродажаТоваровТовары.Цена КАК Цена,
		|	ПродажаТоваровТовары.Количество КАК Количество,
		|	ПродажаТоваровТовары.Сумма КАК Сумма
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|ГДЕ
		|	ПродажаТоваровТовары.Ссылка.Ссылка = &док";
		Запрос.Параметры.Вставить("док",Выборка.ДокументОснование);

	Выборка2 = Запрос.Выполнить().Выбрать();
	
	Товары = Макет.ПолучитьОбласть("Товары");
	Строка1= Макет.ПолучитьОбласть("Строка1");
	ТабДок.Вывести(Товары);


//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	Пока Выборка2.Следующий() Цикл
		Строка1.Параметры.Заполнить(Выборка2);	
		ТабДок.Вывести(Строка1);
	КонецЦикла;
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
     
		//
		

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры
