функция возвратводителя()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бригады.НомерАвтомобиля КАК НомерАвтомобиля,
		|	Бригады.Водитель КАК Водитель
		|ИЗ
		|	РегистрСведений.Бригады КАК Бригады
		|ГДЕ
		|	 Бригады.НомерАвтомобиля = &НомерАвто";
	
	//Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("НомерАвто",НомерАвтомобиля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		вод=ВыборкаДетальныеЗаписи.Водитель;
	КонецЕсли;
возврат вод;
конецфункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Заполнение шапки
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаТоваров") Тогда
		// Заполнение шапки
		Покупатель = ДанныеЗаполнения.Покупатель;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения1(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СостояниеБригад Приход
	Движения.СостояниеБригад.Записывать = Истина;
	Движение = Движения.СостояниеБригад.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	
	Движение.НомерАвтомобиля = НомерАвтомобиля;
	Движение.Водитель =возвратводителя();
	Движение.Километраж = Километраж;
	если СтрЧислоВхождений(ТекущееСостояниеЗаказа.Наименование,"отработан")=1 тогда
			
	Движения.КилометражВодителя.Записывать = Истина;
	Движение = Движения.КилометражВодителя.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Водитель =возвратводителя();
	Движение.Километраж = Километраж;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СостояниеБригады
	ОбработкаПроведения1(Отказ, Режим);
	Движения.СостояниеБригады.Записывать = Истина;
	Движение = Движения.СостояниеБригады.Добавить();
	Движение.Период = Дата;
	Движение.НомерАвтомобиля = НомерАвтомобиля;
	Движение.Автомобиль = Автомобиль;
	Движение.ТекущееСостояниеЗаказа = ТекущееСостояниеЗаказа;
	Движение.Километраж = Километраж;
	Движение.Водитель =возвратводителя();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
