

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	Объект.Наименование=Объект.Водитель;
	если ПроверкаЗанятости() тогда
		Объект.Наименование=Объект.Водитель;
		ЗаписьЗанятости();   
	иначе
		ОтправкаСообщения();
		Объект.Водитель=NULL;
				отказ=истина;
	конецесли;

КонецПроцедуры

&НаСервере
Функция ЗаписьЗанятости()
	//зан=Объект.Грузчик.получитьобъект();
		об=Объект.Водитель.ПолучитьОбъект();	//зан.Записать();
		об.Занятость="Водитель";
		об.Записать();


КонецФункции

&НаСервере
Функция ПроверкаЗанятости()
	//зан=Объект.Грузчик.получитьобъект();
	флаг=ложь;
	если Объект.Водитель.Занятость="" тогда 
		флаг=Истина;
		возврат флаг;
	иначе
		возврат флаг;
	конецесли;

КонецФункции

&НаСервере
Функция обнуление()
	  	об=Объект.Водитель.ПолучитьОбъект();	//зан.Записать();
		об.Занятость=NULL;
		об.Записать();

КонецФункции

&НаСервере
Функция ОтправкаСообщения()
	  	мес=новый СообщениеПользователю;
		мес.Текст="Данное физическое лицо уже задействовано: "+Объект.Водитель.Занятость;
		мес.Сообщить();

КонецФункции


&НаКлиенте
Процедура ВодительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	если Не ПроверкаЗанятости() тогда
		Обнуление();   
	конецесли;

КонецПроцедуры
