

&НаСервере
Процедура заполнение()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	список.Очистить();
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Грузчики.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Грузчики КАК Грузчики";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	
		Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	Бригады.Грузчик1.Ссылка КАК Грузчик1Ссылка,
		|	Бригады.Грузчик2.Ссылка КАК Грузчик2Ссылка
		|ИЗ
		|	РегистрСведений.Бригады КАК Бригады
		|ГДЕ
		|	Бригады.Период = &МояДата";
	Запрос2.УстановитьПараметр("МояДата",Дата);
	РезультатЗапроса2 = Запрос2.Выполнить();
	
	Выборка2 = РезультатЗапроса2.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  выборка2.Следующий();
		если ВыборкаДетальныеЗаписи.ссылка<>выборка2.Грузчик1Ссылка и ВыборкаДетальныеЗаписи<>выборка2.Грузчик2Ссылка тогда
			список.Добавить(ВыборкаДетальныеЗаписи.ссылка,ВыборкаДетальныеЗаписи.ссылка);	
		конецесли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры



&НаКлиенте
Процедура Выборка(Команда)
	заполнение();
		
КонецПроцедуры

&НаСервере
функция операциявыбора(ссылка,ссылка2)
	   //объект1=ссылка2.получитьобъект(); 
	   //об2=ссылка.получитьобъект();
	    объект1=ссылка2.получитьобъект();
		объект1.Грузчик1=ссылка;
		объект1.Записать();
Конецфункции

&НаКлиенте
Процедура Выбрать(Команда)
		этаформа.ВладелецФормы.ВыделенныйТекст=элементы.Список.ТекущиеДанные.Значение;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		Дата=ЭтотОбъект.ВладелецФормы.Родитель.Объект.Дата;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


